# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.observability.data.azurerm_client_config.current: Reading...
module.observability.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.grafana.data.http.api_key will be read during apply
  # (config refers to values not yet known)
 <= data "http" "api_key" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + method               = "POST"
      + request_body         = (sensitive value)
      + request_headers      = {
          + "Content-Type" = "application/x-www-form-urlencoded"
        }
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = (sensitive value)
    }

  # module.grafana.azuread_application.grafana will be created
  + resource "azuread_application" "grafana" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "grafana-auth-at22-admin-sp"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "cc75a1cc-d6a1-4530-828f-86832ce91b9b",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)
    }

  # module.grafana.azuread_service_principal.grafana will be created
  + resource "azuread_service_principal" "grafana" {
      + account_enabled              = true
      + app_role_assignment_required = false
      + app_role_ids                 = (known after apply)
      + app_roles                    = (known after apply)
      + application_tenant_id        = (known after apply)
      + client_id                    = (known after apply)
      + display_name                 = (known after apply)
      + homepage_url                 = (known after apply)
      + id                           = (known after apply)
      + logout_url                   = (known after apply)
      + oauth2_permission_scope_ids  = (known after apply)
      + oauth2_permission_scopes     = (known after apply)
      + object_id                    = (known after apply)
      + redirect_uris                = (known after apply)
      + saml_metadata_url            = (known after apply)
      + service_principal_names      = (known after apply)
      + sign_in_audience             = (known after apply)
      + tags                         = (known after apply)
      + type                         = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # module.grafana.azuread_service_principal_password.grafana will be created
  + resource "azuread_service_principal_password" "grafana" {
      + display_name         = (known after apply)
      + end_date             = (known after apply)
      + id                   = (known after apply)
      + key_id               = (known after apply)
      + rotate_when_changed  = (known after apply)
      + service_principal_id = (known after apply)
      + start_date           = (known after apply)
      + value                = (sensitive value)
    }

  # module.grafana.azurerm_dashboard_grafana.grafana will be created
  + resource "azurerm_dashboard_grafana" "grafana" {
      + api_key_enabled                        = true
      + auto_generated_domain_name_label_scope = "TenantReuse"
      + deterministic_outbound_ip_enabled      = true
      + endpoint                               = (known after apply)
      + grafana_major_version                  = "11"
      + grafana_version                        = (known after apply)
      + id                                     = (known after apply)
      + location                               = "norwayeast"
      + name                                   = "grafana-auth-at22"
      + outbound_ip                            = (known after apply)
      + public_network_access_enabled          = true
      + resource_group_name                    = "grafana-auth-at22-rg"
      + sku                                    = "Standard"
      + zone_redundancy_enabled                = false

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.grafana.azurerm_resource_group.grafana will be created
  + resource "azurerm_resource_group" "grafana" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "grafana-auth-at22-rg"
    }

  # module.grafana.azurerm_role_assignment.grafana_admin will be created
  + resource "azurerm_role_assignment" "grafana_admin" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # module.grafana.grafana_service_account.admin will be created
  + resource "grafana_service_account" "admin" {
      + id          = (known after apply)
      + is_disabled = false
      + name        = "admin-service-account"
      + role        = "Admin"
    }

  # module.grafana.grafana_service_account_token.grafana_operator will be created
  + resource "grafana_service_account_token" "grafana_operator" {
      + expiration         = (known after apply)
      + has_expired        = (known after apply)
      + id                 = (known after apply)
      + key                = (sensitive value)
      + name               = "grafana-operator"
      + service_account_id = (known after apply)
    }

  # module.grafana.time_rotating.grafana_admin_sp_pwd will be created
  + resource "time_rotating" "grafana_admin_sp_pwd" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @bengtfredh |
| Action | `pull_request` |
| Working Directory | `./infrastructure/altinn-auth-test/auth-at22-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/auth-at22-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_auth-at22-aks-rg.tfstate.tfplan`